In [1]:
import pandas as pd

In [3]:
df=pd.read_csv('./csv/countries.csv')

In [4]:
df['name'] #series

0                            Andorra
1               United Arab Emirates
2                        Afghanistan
3                Antigua and Barbuda
4                           Anguilla
                   ...
243                          Mayotte
244                     South Africa
245                           Zambia
246                         Zimbabwe
247    Unknown or unassigned country
Name: name, Length: 248, dtype: object

In [5]:
type(df['name'])

pandas.core.series.Series

In [6]:
df[['name']]

                              name
0                          Andorra
1             United Arab Emirates
2                      Afghanistan
3              Antigua and Barbuda
4                         Anguilla
..                             ...
243                        Mayotte
244                   South Africa
245                         Zambia
246                       Zimbabwe
247  Unknown or unassigned country

[248 rows x 1 columns]

In [7]:
type(df[['name']])

pandas.core.frame.DataFrame

In [8]:
print(type(df['name']))
print(type(df[['name']]))

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

In [9]:
df[['name','continent']]

                              name continent
0                          Andorra        EU
1             United Arab Emirates        AS
2                      Afghanistan        AS
3              Antigua and Barbuda       NaN
4                         Anguilla       NaN
..                             ...       ...
243                        Mayotte        AF
244                   South Africa        AF
245                         Zambia        AF
246                       Zimbabwe        AF
247  Unknown or unassigned country        AF

[248 rows x 2 columns]

In [11]:
sub_df=df.loc[1:10,['name','continent']]
sub_df

                    name continent
1   United Arab Emirates        AS
2            Afghanistan        AS
3    Antigua and Barbuda       NaN
4               Anguilla       NaN
5                Albania        EU
6                Armenia        AS
7                 Angola        AF
8             Antarctica        AN
9              Argentina        SA
10        American Samoa        OC

In [12]:
df['continent'].value_counts()

AF    60
AS    54
EU    50
OC    27
SA    14
AN     2
Name: continent, dtype: int64

In [13]:
df['continent'].unique()

array(['EU', 'AS', nan, 'AF', 'AN', 'SA', 'OC'], dtype=object)

# Series

In [16]:
x=[1,3,7,'f']
sr=pd.Series(x)
sr

0    1
1    3
2    7
3    f
dtype: object

In [17]:
x=[1,3,7,'f']
sr=pd.Series(x,index=['a','b','c','d'])
sr

a    1
b    3
c    7
d    f
dtype: object

In [19]:
sr[2]

7

In [20]:
sr['c']

7